#include <iostream>
#include <set>

int main() {
    srand(time(NULL));
    std::set<std::string> quotes;

    quotes.insert("Що розум людини може осягнути і в що він може повірити, те він здатний досягти, – Наполеон Хілл.");
    quotes.insert("Прагніть не до успіху, а до цінностей, які він дає, – Альберт Айнштайн.");
    quotes.insert("Своїм успіхом я зобов’язана тому, що ніколи не виправдовувалася і не приймала виправдань від інших. – Флоренс Найтінгейл.");
    quotes.insert("За свою кар’єру я пропустив понад 9000 кидків, програв майже 300 ігор. 26 раз мені довіряли зробити фінальний переможний кидок, і я промахувався. Я зазнавав поразок знову, і знову, і знову. І саме тому я домігся успіху., – Майкл Джордан.");
    quotes.insert("Найскладніше почати діяти, все інше залежить тільки від наполегливості., – Амелія Ергарт.");
    quotes.insert("Життя – це те, що з тобою відбувається, поки ти будуєш плани., Джон Леннон.");
    quotes.insert("Логіка може привести вас. від пункту “А” до пункту “Б”, а уява – куди завгодно, – Альберт Айнштайн.");
    quotes.insert("Через 20 років ви будете більше розчаровані тими речами, які ви не робили, ніж тими, які ви зробили. Тому відчальте від тихої пристані. Відчуйте попутний вітер у вашому вітрилі. Рухайтеся вперед, дійте, відкривайте!, – Марк Твен.");
    quotes.insert("Неосмислене життя не варте того, щоб його прожити., – Сократ.");
    quotes.insert("У моєму словнику немає слова “неможливо”., – Наполеон Бонапарт.");

    for (int i = 0; i < quotes.size(); i++) {
        int index = rand() % quotes.size();
        auto it = quotes.begin();

        std::advance(it, index);
        std::cout << *it << "\n";
    }

    return 0;
}

/*
Створіть множину рядків. За допомогою метода insert додайте в неї 9 цитат відомих людей.
Створіть програму, яка випадковим чином в циклі виводитиме на екран по одній цитаті з такої множини.
*/
